Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.guidance.remoteScopeRequiredReply
source: Live GitHub data requires an exact repository scope. Add an @repository and ask again.
ar: تتطلب بيانات GitHub المباشرة نطاق مستودع محدد. أضف @مستودع واسأل مرة أخرى.
de: Live-GitHub-Daten erfordern einen genauen Repository-Bereich. Fügen Sie ein @repository hinzu und fragen Sie erneut.
es: Los datos en vivo de GitHub requieren un ámbito de repositorio exacto. Añade un @repositorio y vuelve a preguntar.
fr: Les données GitHub en direct nécessitent une portée de dépôt exacte. Ajoutez @repository et posez à nouveau la question.
id: Data GitHub langsung memerlukan cakupan repositori yang tepat. Tambahkan @repositori dan tanyakan lagi.
it: I dati live di GitHub richiedono un ambito esatto del repository. Aggiungi un @repository e riprova.
ja: ライブGitHubデータには正確なリポジトリスコープが必要です。@repository を追加してからもう一度質問してください。
ko: 실시간 GitHub 데이터에는 정확한 저장소 범위가 필요합니다. @repository를 추가하고 다시 질문하세요.
nl: Live GitHub-gegevens vereisen een exact repositorybereik. Voeg een @repository toe en vraag opnieuw.
pl: Dane z GitHub na żywo wymagają dokładnego zakresu repozytorium. Dodaj @repository i zapytaj ponownie.
pt_br: Dados ao vivo do GitHub exigem um escopo exato de repositório. Adicione um @repositório e pergunte novamente.
ru: Для живых данных GitHub требуется точная область репозитория. Добавьте @репозиторий и задайте вопрос снова.
tr: Canlı GitHub verileri tam bir depo kapsamı gerektirir. Bir @depo ekleyip tekrar sorun.
uk: Для живих даних GitHub потрібна точна область репозиторію. Додайте @repository і запитайте знову.
vi: Dữ liệu GitHub trực tiếp yêu cầu phạm vi kho lưu trữ chính xác. Thêm @repository và hỏi lại.
zh_hans: 查询 GitHub 实时数据需要明确仓库范围。请先添加一个 @仓库 后再提问。
zh_hant: 查詢 GitHub 即時資料需要明確倉庫範圍。請先新增一個 @倉庫 後再提問。

# rag.workspace.guidance.repoUnavailable
source: A repository used by this suggestion is no longer in the knowledge base. Please choose a new repository scope.
ar: المستودع المستخدم في هذا الاقتراح لم يعد موجودًا في قاعدة المعرفة. يرجى اختيار نطاق مستودع جديد.
de: Ein von diesem Vorschlag verwendetes Repository ist nicht mehr in der Wissensdatenbank. Bitte wählen Sie einen neuen Repository-Bereich.
es: Un repositorio usado por esta sugerencia ya no está en la base de conocimiento. Elige un nuevo ámbito de repositorio.
fr: Un dépôt utilisé par cette suggestion n'est plus dans la base de connaissances. Veuillez choisir une nouvelle portée de dépôt.
id: Repositori yang digunakan oleh saran ini tidak lagi ada di basis pengetahuan. Silakan pilih cakupan repositori baru.
it: Un repository utilizzato da questo suggerimento non è più nella knowledge base. Scegli un nuovo ambito del repository.
ja: この提案で使用されていたリポジトリがナレッジベースから削除されました。新しいリポジトリスコープを選択してください。
ko: 이 제안에 사용된 저장소가 더 이상 지식 베이스에 없습니다. 새 저장소 범위를 선택하세요.
nl: Een repository dat door deze suggestie wordt gebruikt, staat niet meer in de kennisbank. Kies een nieuw repositorybereik.
pl: Repozytorium użyte w tej sugestii nie znajduje się już w bazie wiedzy. Wybierz nowy zakres repozytoriów.
pt_br: Um repositório usado por esta sugestão não está mais na base de conhecimento. Escolha um novo escopo de repositório.
ru: Репозиторий, используемый этой подсказкой, больше не находится в базе знаний. Пожалуйста, выберите новую область репозитория.
tr: Bu önerinin kullandığı bir depo artık bilgi tabanında değil. Lütfen yeni bir depo kapsamı seçin.
uk: Репозиторій, який використовується цією пропозицією, більше не в базі знань. Виберіть нову область репозиторію.
vi: Một kho lưu trữ được sử dụng bởi gợi ý này không còn trong cơ sở tri thức nữa. Vui lòng chọn phạm vi kho lưu trữ mới.
zh_hans: 这个推荐问题关联的仓库已不在知识库中，请重新选择仓库范围。
zh_hant: 這個推薦問題關聯的倉庫已不在知識庫中，請重新選擇倉庫範圍。

# rag.workspace.guidance.scope
source: Knowledge Base guidance
ar: إرشادات قاعدة المعرفة
de: Wissensdatenbank-Hilfestellung
es: Guía de la base de conocimiento
fr: Conseils sur la base de connaissances
id: Panduan Basis Pengetahuan
it: Guida della Knowledge Base
ja: ナレッジベースガイダンス
ko: 지식 베이스 안내
nl: Kennisbankbegeleiding
pl: Wskazówki bazy wiedzy
pt_br: Orientação da Base de Conhecimento
ru: Подсказки базы знаний
tr: Bilgi tabanı rehberliği
uk: Підказки бази знань
vi: Hướng dẫn cơ sở tri thức
zh_hans: 知识库提问引导
zh_hant: 知識庫提問引導

# rag.workspace.guidance.socialPlan
source: Recognized a greeting and prepared knowledge-base question suggestions locally.
ar: تم التعرف على تحية وتم تحضير اقتراحات أسئلة قاعدة المعرفة محليًا.
de: Begrüßung erkannt und lokal Vorschläge für Wissensdatenbank-Fragen vorbereitet.
es: Se reconoció un saludo y se prepararon sugerencias de preguntas de la base de conocimiento localmente.
fr: Salutation reconnue et suggestions de questions préparées localement.
id: Mengenali salam dan menyiapkan saran pertanyaan basis pengetahuan secara lokal.
it: Riconosciuto un saluto e preparati suggerimenti per domande sulla knowledge base localmente.
ja: 挨拶を認識し、ローカルでナレッジベースの質問候補を準備しました。
ko: 인사말을 인식하고 로컬에서 지식 베이스 질문 제안을 준비했습니다.
nl: Groet herkend en suggesties voor kennisbankvragen lokaal voorbereid.
pl: Rozpoznano powitanie i przygotowano lokalnie sugestie pytań do bazy wiedzy.
pt_br: Saudação reconhecida e sugestões de perguntas da base de conhecimento preparadas localmente.
ru: Распознано приветствие и локально подготовлены предложения вопросов по базе знаний.
tr: Bir selamlama tanındı ve bilgi tabanı soru önerileri yerel olarak hazırlandı.
uk: Розпізнано вітання та підготовлено пропозиції запитань до бази знань локально.
vi: Đã nhận diện lời chào và chuẩn bị các gợi ý câu hỏi cơ sở tri thức cục bộ.
zh_hans: 已识别为问候，并在本地准备知识库问题建议。
zh_hant: 已識別為問候，並在本機準備知識庫問題建議。

# rag.workspace.guidance.socialReply
source: Hello! I answer questions from your Starcat knowledge base. Choose a question below, or ask about a repository in your knowledge base.
ar: مرحبًا! أجيب على الأسئلة من قاعدة معرفة Starcat الخاصة بك. اختر سؤالاً أدناه، أو اسأل عن مستودع في قاعدة معرفتك.
de: Hallo! Ich beantworte Fragen aus Ihrer Starcat-Wissensdatenbank. Wählen Sie eine Frage unten oder fragen Sie nach einem Repository in Ihrer Wissensdatenbank.
es: ¡Hola! Respondo preguntas de tu base de conocimiento de Starcat. Elige una pregunta a continuación o pregunta sobre un repositorio en tu base de conocimiento.
fr: Bonjour ! Je réponds aux questions de votre base de connaissances Starcat. Choisissez une question ci-dessous, ou posez une question sur un dépôt de votre base de connaissances.
id: Halo! Saya menjawab pertanyaan dari basis pengetahuan Starcat Anda. Pilih pertanyaan di bawah, atau tanyakan tentang repositori di basis pengetahuan Anda.
it: Ciao! Rispondo a domande dalla tua knowledge base di Starcat. Scegli una domanda qui sotto o chiedi informazioni su un repository nella tua knowledge base.
ja: こんにちは！Starcatナレッジベースからの質問にお答えします。以下の質問を選ぶか、ナレッジベース内のリポジトリについて質問してください。
ko: 안녕하세요! Starcat 지식 베이스의 질문에 답변합니다. 아래에서 질문을 선택하거나 지식 베이스의 저장소에 대해 물어보세요.
nl: Hallo! Ik beantwoord vragen uit uw Starcat-kennisbank. Kies een vraag hieronder of stel een vraag over een repository in uw kennisbank.
pl: Witaj! Odpowiadam na pytania z Twojej bazy wiedzy Starcat. Wybierz pytanie poniżej lub zapytaj o repozytorium w swojej bazie wiedzy.
pt_br: Olá! Respondo perguntas da sua base de conhecimento do Starcat. Escolha uma pergunta abaixo ou pergunte sobre um repositório na sua base de conhecimento.
ru: Здравствуйте! Я отвечаю на вопросы из вашей базы знаний Starcat. Выберите вопрос ниже или спросите о репозитории в вашей базе знаний.
tr: Merhaba! Starcat bilgi tabanınızdan soruları yanıtlıyorum. Aşağıdan bir soru seçin veya bilgi tabanınızdaki bir depo hakkında soru sorun.
uk: Привіт! Я відповідаю на запитання з вашої бази знань Starcat. Виберіть запитання нижче або запитайте про репозиторій у вашій базі знань.
vi: Xin chào! Tôi trả lời các câu hỏi từ cơ sở tri thức Starcat của bạn. Chọn một câu hỏi bên dưới hoặc hỏi về một kho lưu trữ trong cơ sở tri thức của bạn.
zh_hans: 你好！我主要根据你的 Starcat 知识库回答仓库相关问题。你可以点击下面的问题，或直接询问知识库中的项目。
zh_hant: 你好！我主要根據你的 Starcat 知識庫回答倉庫相關問題。你可以點選下面的問題，或直接詢問知識庫中的專案。

# rag.workspace.guidance.suggestedTitle
source: Try asking
ar: جرّب السؤال
de: Versuchen Sie zu fragen
es: Intenta preguntar
fr: Essayez de demander
id: Coba tanyakan
it: Prova a chiedere
ja: 試してみる
ko: 질문해 보세요
nl: Probeer te vragen
pl: Spróbuj zapytać
pt_br: Tente perguntar
ru: Попробуйте спросить
tr: Sormayı dene
uk: Спробуйте запитати
vi: Thử hỏi
zh_hans: 你可以继续问
zh_hant: 你可以繼續問

# rag.workspace.header.knowledge
source: Knowledge
ar: المعرفة
de: Wissen
es: Conocimiento
fr: Connaissances
id: Pengetahuan
it: Conoscenza
ja: ナレッジ
ko: 지식
nl: Kennis
pl: Wiedza
pt_br: Conhecimento
ru: Знания
tr: Bilgi
uk: Знання
vi: Kiến thức
zh_hans: 知识库
zh_hant: 知识库

# rag.workspace.header.ready
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
id: Siap
it: Pronto
ja: 準備完了
ko: 준비
nl: Gereed
pl: Gotowe
pt_br: Pronto
ru: Готово
tr: Hazır
uk: Готово
vi: Sẵn sàng
zh_hans: 已就绪
zh_hant: 已就绪

# rag.workspace.history.loadEarlier
source: Load more history
ar: تحميل المزيد من السجل
de: Weitere Verläufe laden
es: Cargar más historial
fr: Charger plus d'historique
id: Muat lebih banyak riwayat
it: Carica più cronologia
ja: 履歴をさらに読み込む
ko: 더 많은 기록 불러오기
nl: Meer geschiedenis laden
pl: Wczytaj więcej historii
pt_br: Carregar mais histórico
ru: Загрузить больше истории
tr: Daha fazla geçmiş yükle
uk: Завантажити більше історії
vi: Tải thêm lịch sử
zh_hans: 加载更多历史对话
zh_hant: 加载更多历史对话

# rag.workspace.history.loadEarlier.help
source: Show earlier turns from this conversation
ar: إظهار الأدوار السابقة من هذه المحادثة
de: Frühere Runden dieser Unterhaltung anzeigen
es: Mostrar turnos anteriores de esta conversación
fr: Afficher les tours précédents de cette conversation
id: Tampilkan giliran sebelumnya dari percakapan ini
it: Mostra turni precedenti di questa conversazione
ja: この会話の以前のターンを表示
ko: 이 대화의 이전 턴 표시
nl: Toon eerdere beurten van dit gesprek
pl: Pokaż wcześniejsze tury tej rozmowy
pt_br: Mostrar turnos anteriores desta conversa
ru: Показать более ранние сообщения из этого разговора
tr: Bu konuşmadaki önceki turları göster
uk: Показати попередні повідомлення з цієї розмови
vi: Hiển thị các lượt trước đó từ cuộc trò chuyện này
zh_hans: 再显示当前会话更早的历史对话
zh_hant: 显示当前会话更早的历史对话

# rag.workspace.index.embedding
source: Embedding
ar: التضمين
es: Incrustación
fr: Plongement
ja: 埋め込み
ko: 임베딩
nl: Inbedding
pl: Osadzanie
pt_br: Incorporação
ru: Эмбеддинг
tr: Gömme
uk: Векторизація
vi: Nhúng
zh_hans: 向量化
zh_hant: 向量化

# rag.workspace.index.embeddingModel.configure
source: Configure embedding model
ar: تكوين نموذج التضمين
de: Embedding-Modell konfigurieren
es: Configurar modelo de incrustación
fr: Configurer le modèle de plongement
id: Konfigurasikan model embedding
it: Configura modello di embedding
ja: 埋め込みモデルを設定
ko: 임베딩 모델 구성
nl: Inbeddingsmodel configureren
pl: Skonfiguruj model osadzania
pt_br: Configurar modelo de incorporação
ru: Настроить модель эмбеддинга
tr: Gömme modelini yapılandır
uk: Налаштувати модель векторизації
vi: Cấu hình mô hình nhúng
zh_hans: 配置向量模型
zh_hant: 配置向量模型

# rag.workspace.index.embeddingModel.unavailable
source: Not configured or invalid
ar: غير مكوّن أو غير صالح
de: Nicht konfiguriert oder ungültig
es: No configurado o inválido
fr: Non configuré ou invalide
id: Belum dikonfigurasi atau tidak valid
it: Non configurato o non valido
ja: 未設定または無効
ko: 구성되지 않음 또는 유효하지 않음
nl: Niet geconfigureerd of ongeldig
pl: Nieskonfigurowany lub nieprawidłowy
pt_br: Não configurado ou inválido
ru: Не настроена или недействительна
tr: Yapılandırılmamış veya geçersiz
uk: Не налаштовано або недійсно
vi: Chưa được cấu hình hoặc không hợp lệ
zh_hans: 未配置或配置无效
zh_hant: 未配置或配置无效

# rag.workspace.index.health
source: Index health
ar: سلامة الفهرس
de: Index-Integrität
es: Salud del índice
fr: Santé de l'index
id: Kesehatan indeks
it: Salute dell'indice
ja: インデックスの健全性
ko: 인덱스 상태
nl: Indexstatus
pl: Stan indeksu
pt_br: Saúde do índice
ru: Состояние индекса
tr: Dizin sağlığı
uk: Стан індексу
vi: Tình trạng chỉ mục
zh_hans: 索引健康
zh_hant: 索引健康

# rag.workspace.index.issues.currentModelFormat
source: Current model: %@
ar: النموذج الحالي: %@
de: Aktuelles Modell: %@
es: Modelo actual: %@
fr: Modèle actuel : %@
id: Model saat ini: %@
it: Modello corrente: %@
ja: 現在のモデル: %@
ko: 현재 모델: %@
nl: Huidig model: %@
pl: Bieżący model: %@
pt_br: Modelo atual: %@
ru: Текущая модель: %@
tr: Geçerli model: %@
uk: Поточна модель: %@
vi: Mô hình hiện tại: %@
zh_hans: 当前模型：%@
zh_hant: 当前模型：%@

# rag.workspace.index.issues.empty
source: No matching chunks
ar: لا توجد مقاطع متطابقة
de: Keine passenden Chunks
es: Sin fragmentos coincidentes
fr: Aucun fragment correspondant
id: Tidak ada potongan yang cocok
it: Nessun blocco corrispondente
ja: 一致するチャンクがありません
ko: 일치하는 청크 없음
nl: Geen overeenkomende fragmenten
pl: Brak pasujących fragmentów
pt_br: Nenhum trecho correspondente
ru: Нет совпадающих фрагментов
tr: Eşleşen parça yok
uk: Немає відповідних фрагментів
vi: Không có đoạn phù hợp
zh_hans: 暂无匹配分片
zh_hant: 暂无匹配分片

# rag.workspace.index.issues.failedReason
source: Embedding request failed
ar: فشل طلب التضمين
de: Embedding-Anfrage fehlgeschlagen
es: La solicitud de incrustación falló
fr: La demande de plongement a échoué
id: Permintaan embedding gagal
it: Richiesta di embedding fallita
ja: 埋め込みリクエストに失敗しました
ko: 임베딩 요청 실패
nl: Inbeddingsverzoek mislukt
pl: Żądanie osadzenia nie powiodło się
pt_br: Falha na solicitação de incorporação
ru: Запрос эмбеддинга не удался
tr: Gömme isteği başarısız oldu
uk: Помилка запиту векторизації
vi: Yêu cầu nhúng thất bại
zh_hans: 生成向量失败
zh_hant: 生成向量失败

# rag.workspace.index.issues.loadMore
source: Load more
ar: تحميل المزيد
de: Mehr laden
es: Cargar más
fr: Charger plus
id: Muat lebih banyak
it: Carica altro
ja: さらに読み込む
ko: 더 불러오기
nl: Meer laden
pl: Wczytaj więcej
pt_br: Carregar mais
ru: Загрузить ещё
tr: Daha fazla yükle
uk: Завантажити більше
vi: Tải thêm
zh_hans: 加载更多
zh_hant: 加载更多

# rag.workspace.index.issues.pendingAfterFailureFormat
source: Last index refresh failed: %@
ar: فشل آخر تحديث للفهرس: %@
de: Letzte Indexaktualisierung fehlgeschlagen: %@
es: La última actualización del índice falló: %@
fr: Dernier rafraîchissement de l'index échoué : %@
id: Penyegaran indeks terakhir gagal: %@
it: Ultimo aggiornamento indice fallito: %@
ja: 最後のインデックス更新に失敗しました: %@
ko: 마지막 인덱스 새로고침 실패: %@
nl: Laatste indexvernieuwing mislukt: %@
pl: Ostatnie odświeżenie indeksu nie powiodło się: %@
pt_br: Falha na última atualização do índice: %@
ru: Последнее обновление индекса не удалось: %@
tr: Son dizin yenileme başarısız oldu: %@
uk: Останнє оновлення індексу не вдалося: %@
vi: Lần làm mới chỉ mục cuối cùng thất bại: %@
zh_hans: 最近一次索引刷新失败：%@
zh_hant: 最近一次索引刷新失败：%@

# rag.workspace.index.issues.pendingReason
source: Waiting for embedding
ar: في انتظار التضمين
de: Warte auf Embedding
es: Esperando incrustación
fr: En attente de plongement
id: Menunggu embedding
it: In attesa di embedding
ja: 埋め込みを待機中
ko: 임베딩 대기 중
nl: Wachten op inbedding
pl: Oczekiwanie na osadzenie
pt_br: Aguardando incorporação
ru: Ожидание эмбеддинга
tr: Gömme bekleniyor
uk: Очікування векторизації
vi: Đang chờ nhúng
zh_hans: 等待生成向量
zh_hant: 等待生成向量

# rag.workspace.index.issues.previousModelFormat
source: Previous model: %@
ar: النموذج السابق: %@
de: Vorheriges Modell: %@
es: Modelo anterior: %@
fr: Modèle précédent : %@
id: Model sebelumnya: %@
it: Modello precedente: %@
ja: 以前のモデル: %@
ko: 이전 모델: %@
nl: Vorig model: %@
pl: Poprzedni model: %@
pt_br: Modelo anterior: %@
ru: Предыдущая модель: %@
tr: Önceki model: %@
uk: Попередня модель: %@
vi: Mô hình trước đó: %@
zh_hans: 原模型：%@
zh_hant: 原模型：%@

# rag.workspace.index.issues.reasonFormat
source: Reason: %@
ar: السبب: %@
de: Grund: %@
es: Motivo: %@
fr: Raison : %@
id: Alasan: %@
it: Motivo: %@
ja: 理由: %@
ko: 이유: %@
nl: Reden: %@
pl: Przyczyna: %@
pt_br: Motivo: %@
ru: Причина: %@
tr: Sebep: %@
uk: Причина: %@
vi: Lý do: %@
zh_hans: 原因：%@
zh_hant: 原因：%@

# rag.workspace.index.issues.sectionFormat
source: Section: %@
ar: القسم: %@
de: Abschnitt: %@
es: Sección: %@
id: Bagian: %@
it: Sezione: %@
ja: セクション: %@
ko: 섹션: %@
nl: Sectie: %@
pl: Sekcja: %@
pt_br: Seção: %@
ru: Раздел: %@
tr: Bölüm: %@
uk: Розділ: %@
vi: Phần: %@
zh_hans: 章节：%@
zh_hant: 章节：%@

# rag.workspace.index.issues.sourcePrefix
source: Source:
ar: المصدر:
de: Quelle:
es: Fuente:
id: Sumber:
it: Fonte:
ja: ソース:
ko: 출처:
nl: Bron:
pl: Źródło:
pt_br: Fonte:
ru: Источник:
tr: Kaynak:
uk: Джерело:
vi: Nguồn:
zh_hans: 来源：
zh_hant: 来源：

# rag.workspace.index.issues.staleReason
source: Embedding model changed
ar: تغيّر نموذج التضمين
de: Embedding-Modell geändert
es: El modelo de incrustación cambió
fr: Modèle de plongement modifié
id: Model embedding berubah
it: Modello di embedding cambiato
ja: 埋め込みモデルが変更されました
ko: 임베딩 모델 변경됨
nl: Inbeddingsmodel gewijzigd
pl: Model osadzania został zmieniony
pt_br: Modelo de incorporação alterado
ru: Модель эмбеддинга изменена
tr: Gömme modeli değişti
uk: Модель векторизації змінено
vi: Mô hình nhúng đã thay đổi
zh_hans: 向量模型已变更
zh_hant: 向量模型已变更

# rag.workspace.index.rebuild
source: Refresh index
ar: تحديث الفهرس
de: Index aktualisieren
es: Actualizar índice
fr: Rafraîchir l'index
id: Segarkan indeks
it: Aggiorna indice
ja: インデックスを更新
ko: 인덱스 새로고침
nl: Index vernieuwen
pl: Odśwież indeks
pt_br: Atualizar índice
ru: Обновить индекс
tr: Dizini yenile
uk: Оновити індекс
vi: Làm mới chỉ mục
zh_hans: 刷新索引
zh_hant: 刷新索引

# rag.workspace.index.recentBuild
source: Latest build
ar: آخر بناء
de: Letzter Build
es: Última compilación
fr: Dernière construction
id: Bangunan terbaru
it: Ultima build
ja: 最新ビルド
ko: 최신 빌드
nl: Laatste build
pl: Ostatnia kompilacja
pt_br: Compilação mais recente
ru: Последняя сборка
tr: Son yapı
uk: Остання збірка
vi: Bản dựng mới nhất
zh_hans: 最近一次构建
zh_hant: 最近一次构建

# rag.workspace.index.sourceBuild
source: Source build
ar: بناء المصدر
de: Quell-Build
es: Compilación de origen
fr: Construction source
id: Bangunan sumber
it: Build sorgente
ja: ソースビルド
ko: 소스 빌드
nl: Bronbuild
pl: Kompilacja źródła
pt_br: Compilação da fonte
ru: Сборка источника
tr: Kaynak yapısı
uk: Збірка джерела
vi: Bản dựng nguồn
zh_hans: 分片构建
zh_hant: 分片构建

# rag.workspace.inspector.chunkCreatedAt
source: Chunk created at
ar: تم إنشاء المقطع في
de: Chunk erstellt am
es: Fragmento creado el
fr: Fragment créé le
id: Potongan dibuat pada
it: Blocco creato il
ja: チャンク作成日時
ko: 청크 생성 시간
nl: Fragment aangemaakt op
pl: Fragment utworzony
pt_br: Trecho criado em
ru: Фрагмент создан
tr: Parça oluşturulma zamanı
uk: Фрагмент створено
vi: Đoạn được tạo lúc
zh_hans: 分片创建时间
zh_hant: 分片创建时间

# rag.workspace.inspector.chunkMissing
source: The cited chunk was cleared or requires an index rebuild.
ar: تم مسح المقطع المُستشهد به أو يتطلب إعادة بناء الفهرس.
de: Der zitierte Chunk wurde gelöscht oder erfordert eine Index-Neuerstellung.
es: El fragmento citado fue borrado o requiere una reconstrucción del índice.
fr: Le fragment cité a été effacé ou nécessite une reconstruction de l'index.
id: Potongan yang dikutip telah dibersihkan atau memerlukan pembangunan ulang indeks.
it: Il blocco citato è stato cancellato o richiede una ricostruzione dell'indice.
ja: 引用されたチャンクはクリアされたか、インデックスの再構築が必要です。
ko: 인용된 청크가 지워졌거나 인덱스 재빌드가 필요합니다.
nl: Het geciteerde fragment is gewist of vereist een indexvernieuwing.
pl: Cytowany fragment został wyczyszczony lub wymaga przebudowy indeksu.
pt_br: O trecho citado foi limpo ou requer uma reconstrução do índice.
ru: Цитируемый фрагмент был очищен или требует перестройки индекса.
tr: Alıntılanan parça temizlendi veya dizinin yeniden oluşturulması gerekiyor.
uk: Цитований фрагмент було очищено або потребує перебудови індексу.
vi: Đoạn được trích dẫn đã bị xóa hoặc yêu cầu xây dựng lại chỉ mục.
zh_hans: 引用片段已清理或需要重建索引。
zh_hant: 引用片段已清理或需要重建索引。

# rag.workspace.inspector.chunkPopover.charCountFormat
source: %lld chars
ar: %lld حرفًا
de: %lld Zeichen
es: %lld caracteres
fr: %lld caractères
id: %lld karakter
it: %lld caratteri
ja: %lld 文字
ko: %lld자
nl: %lld tekens
pl: %lld znaków
pt_br: %lld caracteres
ru: %lld символов
tr: %lld karakter
uk: %lld символів
vi: %lld ký tự
zh_hans: %lld 字符
zh_hant: %lld 字符

# rag.workspace.inspector.chunkPreview
source: Matched chunk
ar: المقطع المطابق
de: Übereinstimmender Chunk
es: Fragmento coincidente
fr: Fragment correspondant
id: Potongan yang cocok
it: Blocco corrispondente
ja: 一致したチャンク
ko: 일치하는 청크
nl: Overeenkomend fragment
pl: Pasujący fragment
pt_br: Trecho correspondente
ru: Совпавший фрагмент
tr: Eşleşen parça
uk: Знайдений фрагмент
vi: Đoạn phù hợp
zh_hans: 命中的分片
zh_hant: 命中的分片

# rag.workspace.inspector.chunkPreview.expand
source: Click to view the full matched chunk
ar: انقر لعرض المقطع المطابق بالكامل
de: Klicken, um den vollständigen übereinstimmenden Chunk anzuzeigen
es: Haz clic para ver el fragmento coincidente completo
fr: Cliquez pour voir le fragment complet correspondant
id: Klik untuk melihat potongan yang cocok secara penuh
it: Clicca per visualizzare il blocco corrispondente completo
ja: クリックして一致したチャンク全体を表示
ko: 클릭하여 전체 일치 청크 보기
nl: Klik om het volledige overeenkomende fragment te bekijken
pl: Kliknij, aby wyświetlić pełny pasujący fragment
pt_br: Clique para ver o trecho correspondente completo
ru: Нажмите, чтобы просмотреть полный совпавший фрагмент
tr: Tam eşleşen parçayı görüntülemek için tıklayın
uk: Натисніть, щоб переглянути повний знайдений фрагмент
vi: Nhấp để xem toàn bộ đoạn phù hợp
zh_hans: 点击查看完整命中分片
zh_hant: 点击查看完整命中分片

# rag.workspace.inspector.chunkTruncated
source: This chunk was truncated during indexing.
ar: تم اقتطاع هذا المقطع أثناء الفهرسة.
de: Dieser Chunk wurde während der Indizierung abgeschnitten.
es: Este fragmento fue truncado durante la indexación.
fr: Ce fragment a été tronqué lors de l'indexation.
id: Potongan ini dipotong selama pengindeksan.
it: Questo blocco è stato troncato durante l'indicizzazione.
ja: このチャンクはインデックス作成中に切り詰められました。
ko: 이 청크는 인덱싱 중에 잘렸습니다.
nl: Dit fragment is tijdens het indexeren afgekapt.
pl: Ten fragment został obcięty podczas indeksowania.
pt_br: Este trecho foi truncado durante a indexação.
ru: Этот фрагмент был обрезан во время индексации.
tr: Bu parça dizin oluşturma sırasında kısaltıldı.
uk: Цей фрагмент було скорочено під час індексації.
vi: Đoạn này đã bị cắt ngắn trong quá trình lập chỉ mục.
zh_hans: 该分片在索引时已截断。
zh_hant: 该分片在索引时已截断。

# rag.workspace.inspector.citations
source: Citations
ar: الاقتباسات
de: Zitate
es: Citas
id: Kutipan
it: Citazioni
ja: 引用
ko: 인용
nl: Citaten
pl: Cytaty
pt_br: Citações
ru: Цитаты
tr: Alıntılar
uk: Цитати
vi: Trích dẫn
zh_hans: 引用
zh_hant: 引用

# rag.workspace.inspector.citationStarcatDetail
source: Starcat detail
ar: تفاصيل Starcat
es: Detalle de Starcat
fr: Détail Starcat
id: Detail Starcat
it: Dettaglio Starcat
ja: Starcat 詳細
ko: Starcat 상세
pl: Szczegóły Starcat
pt_br: Detalhe do Starcat
ru: Подробности Starcat
tr: Starcat detayı
uk: Деталі Starcat
vi: Chi tiết Starcat
zh_hans: Starcat 详情
zh_hant: Starcat 详情
